{
    "blogs": [
      {
        "id": "-NS2emq2DbX9Alvl3aku",
        "title": "What We Do",
        "author": "VISHWA MOHAN TIWARI, LAKSH SADHWANI",
        "description": "OCTOBER 7TH, 2022",
        "slug": "ietnitk_intro",
        "image_url": "https://firebasestorage.googleapis.com/v0/b/py-ssg.appspot.com/o/055SCFACYO%2Fthumbnail.jpg?alt=media",
        "markdown": "![ietnitk_intro](https://user-images.githubusercontent.com/85332648/229377392-f2b6bb27-2285-4745-8799-cd1e770168cb.jpg) \n\n\n\n# What We Do\n\n##### *BY VISHWA MOHAN TIWARI AND LAKSH SADHWANI - OCTOBER 7TH, 2022*\n\n\n\nIET NITK is an exclusive technical club under the IET Bangalore Division. We are one of the five other SIGs that form the exclusive club group in IET NITK.\n\n\n\nWe'll be using this article to explain how IET NITK works and what are the parts of our club: we'd explain our each of our SIGs work. Also make sure that you read on till they end: we have some tips and suggestions for you on how to deal with the recruitment season as well.\n\n\n\n![ietnitk_intro](https://user-images.githubusercontent.com/85332648/229377409-033964de-fffc-408d-bc93-98113447415d.jpg)\n\n\n\n*Our seniors from Batch of 2020 and 2021*\n\n\n\n![ietnitk_intro](https://user-images.githubusercontent.com/85332648/229377421-37801e0a-d29d-4145-b957-989d43a7cf92.jpg)\n\n\n\n*This is a shot from our interview with Pratyush Giri, SCP 2018*\n\n\n\n## *Cipher*\n\n\n\n![ietnitk_intro](https://user-images.githubusercontent.com/85332648/229377442-7b6a6bce-5ccc-4bea-836f-d98146a71408.png)\n\n\n\n*That's our 2019 convenor Bhargav and 2020 convenor Skanda showcasing their Cipher project.*\n\n\n\nWe are the Computer Science SIG of IET NITK. Here is where you can pursue your interest in anything and everything that has a computer (and some coffee?) involved in it: from competitive programming to machine learning and from blockchain to web and mobile development.\n\n\n\nWe also have a strong presence on our IET NITK Discord channel, where we encourage people with different tastes in computer science to hang out and share resources on what they like or what they wish to learn.\n\n\n\nSome of our highlight projects are: Virtual TryOn (trying on fashion virtually via AR), Experiencing Homes in VR (Checking out homes and apartments virtually) & Face to Emoji (an ML model to convert a portrait to an emoji). None of these projects were conceived overnight: we consider and evaluate our projects each year after thorough discussions and requirements analysis.\n\n\n\nWe love to conduct events as well: we find that there is a huge trove of topics in Computer Science that we can geek about, so we encourage all our members to hold KEPs to enlighten the audience. Despite the online semester, we've held some of our highlight events like Brute Force Made Easy (our annual CP contest), CommitCon (Git and Open Source Festival) and Innerve (IET NITK's annual showcase). And this year, we have an even bigger agenda on the events side: to bring in professionals and alumni to enlighten us about their particular fields.\n\n\n\nDon't be under the impression that all we do is host public events and do projects! We also hold weekly CP preparation contests for our members before summer vacations for internship and placement season as well. And we're definitely not \"all work and no play\" either: we regularly hold SIG-wide game contests to engage all the members too.\n\n\n\n## Recruitment Process\n\n\n\nThe first step, as always, is to fill the main IET NITK recruitment form from here. With that done, following is the process:\n\n- An online test to evaluate your knowledge on C programming ,Basic C concepts and Aptitude.\n\n- A Technical interview for us to know more about you: how you are, and how you would approach a problem in the CS/IT field.\n\n- An HR interview to know what you’re looking for and what you can offer to IET NITK and Cipher in general.\n\n\n\n## *Rovisp*\n\n\n\n![ietnitk_intro](https://user-images.githubusercontent.com/85332648/229377449-5c17ad5f-2d01-4910-ac64-a3dc819bafbf.jpg)\n\n\n\n*Likitha at Project Expo*\n\n\n\nRovisp SIG is a group of IET people interested in electronics, communication, ML and signal processing. Here is a place to pursue your interest in software + hardware (embedded). From implementing and demonstrating electronics-based hobby projects, conducting Events , Competitions, Knowledge Exchange programs to having mentorship programs for juniors etc. we also have extra co-curricular activities like blog writing, speaker series and sessions from alumni.\n\n\n\nSome of our highlight on projects successfully completed by our SIG are Automatic Medicine Pill Dispenser, Smart Car Parking System, Mini Jarwis using Arduino, Programmable DC load, and more (check out our section on our website).\n\n\n\n![ietnitk_intro](https://user-images.githubusercontent.com/85332648/229377466-ff0f24e5-20bb-4855-b64f-cb8818ebf5f8.png)\n\n\n\n*Speaker series by our alumni Vibhore Jain (Analog Engineer at TI) and Rohan Katkam (MS at TU Delft)*\n\n\n\nAlso here are events conducted by our SIG: Speaker Series from alumnus, PCB Design Workshop, Arduino Workshop, SMP on Digital Design, Home Automation and arduino. Some of our within-club activities are Ethical Hacking KEPs and blog writing.\n\n\n\n## Recruitment Process\n\n\n\nThe first step, as always, is to fill the main IET NITK recruitment form from here. With that done, following is the process:\n\n- A preliminary test to evaluate your knowledge on Basic Electronics(circuit Theory), Digital Electronics(Till combinational circuits), Basics of BJT, Op-amp, Aptitude and puzzles\n\n- A Technical interview for us to know more about you: how you are, and how you tackle problems in Electronics Engineering, ML, Signal processing in general.\n\n- An HR interview to know what you’re looking for and what you can offer to IET NITK and Rovisp in general.\n\n\n\n## *Torsion*\n\n\n\n![ietnitk_intro](https://user-images.githubusercontent.com/85332648/229377473-5462a2bc-52bb-4444-9d96-3eeee3ac4aa3.jpg)\n\n\n\nTorsion is a collaborative space for enthusiasts in the field of Mechanical, Chemical, Civil, Metallurgical and other core departments, to discuss and debate, innovate, build up ideas, and work on a variety of projects. Right from analyzing the problem statements in real life situations to emphasizing the applications of the outcomes we bring out via the above solutions, Torsion has always provided the right guidance path to all its peers.\n\n\n\nSome of our predominant projects in the recent times are CFD Analysis of Dimpled Wings, Stent for constricted Blood Flow, Quadcopter, Rubik’s Solver Bot and various other projects using Ansys and Matlab concepts. These multi concept projects didn't happen overnight. They were taken right from the scratch with group discussions, weekly meetings and requirements such as study materials, tutorials were provided along with one on one interaction sessions at all times.\n\n\n\nKeeping the projects on one hand, Torsion has never failed to enlighten its other aspiring junior core engineers with various mind blowing concepts in their field via various events. Despite the online semester we could successfully pull off events like Torsion sculpt, Talk on research internships and MS Abroad, Webinars on different softwares like blender, CFD, MATLAB, AutoCAD bringing in our alumni from various parts of the world. We give a clear picture on what you guys can do at the present to mold your future in your field of interest.\n\n\n\nAfter all this if you are still figuring out your interests, no worries because Torsion got it's series of KEPs on some really important softwares from both engineering and career point of view. We cover all the way from basic AutoCAD to complex concepts on Catia including Matlab, Ansys, SolidWorks and Blender.\n\n\n\nIsn't this a three year full fledged package on how you can lay down a strong foundation to make the best for your career. To avail this do register for Torsion IET NITK and be a part of our family.\n\n\n\n## Recruitment Process\n\n\n\nFirst thing you should do is to fill the main IET NITK recruitment form from here. With that done, following is the process:\n\n- An online aptitude test to evaluate your knowledge.\n\n- A Technical interview to assess your knowledge about Mechanical, Civil or Chemical Engineering in general. Don't worry, we wont be testing you like professors, but we’ll also use this time to understand how you come up with ideas. We’re interested in seeing your attitude to problem solving in general.\n\n- An HR interview to know what you’re looking for and what you can offer to IET NITK and Torsion in general.\n\n\n\n## *Medium*\n\n\n\nIn Medium SIG we do video editing, graphic design and publicity for our club. It is a non-technical SIG in IET NITK. Responsibility of the Medium SIG is to increase outreach of our social media handles such as Instagram, LinkedIn, Facebook. We create a platform where club members can express their creativity while focusing on other goals. We increase the brand awareness of our club, and keep it going. We create a good image of the club within the student community so that the best people join us. If you love creativity then this is the place you need to be at. We have conducted various KEPs such as the ones on Wondershare Filmora, Adobe Photoshop, OBS. For the summer mentorship program , IET Medium has offered an SMP on Photoshop and Graphic Design called Photoshop, Edits and GD for which there was an immense response.\n\n\n\n## Recruitment Process\n\n\n\nThe first step, as always, is to fill the main IET NITK recruitment form from here. With that done, following is the process:\n\n- A take-home assignment that you would be asked to complete in given time. Details about the assignment would be given to applicants before-hand.\n\n- A Technical interview for us to know more about you: how you are … Basically we want to understand more about you here.\n\n- An HR interview to know what you’re looking for and what you can offer to IET NITK and Medium in general.\n\n\n\n## *Inkheart*\n\n\n\n![ietnitk_intro](https://user-images.githubusercontent.com/85332648/229377493-0b60e744-313e-4bd2-a2ac-f42ba155191e.jpg)\n\n\n\nINKHEART is a non-technical SIG of IET NITK where you can explore and pursue your creative interests in literature, philosophy and creativity through a variety of activities like book reading, debating, weekly talk sessions, etc. It is a place for one’s overall skill development and we aim to keep the developing curve rising with our extensive range of exciting events along with providing an opportunity to lead amazing teams and leave your trail!\n\n\n\nOne of the prominent events of INKHEART is the ESCAPE ROOM series where distinguished speakers from different walks of life come and share their experiences. Another exciting segment is the INKHEART RECOMMENDS where we give audio reviews on a wide range of movies, series and books of different genres. Community, Ugly, Bandersnatch and The Sky Is Pink are some of the popular shows and movies we have reviewed so far and more are yet to come on the list. A session on “The art of cinematic soundscapes” to take you through the process of music production skills and make some tunes, because if it sounds good, it is good Book reviews and Freshers Debate were other spectacular events. Last summer was a happening one with three interesting Summer Mentorship Programmes from Inkheart which included Maestro of Rhetorics, French for Beginners and Lights Camera Script.\n\n\n\nWe love to have fun while learning, so not only do we organize events for the development of the student community, but also have some exciting rounds of games, team bonding sessions, biweekly debate sessions and more fun-filled activities to refresh ourselves from the boredom of academics.\n\n\n\n## Recruitment Process\n\n\n\nThe first step, as always, is to fill the main IET NITK recruitment form from here. With that done, following is the process:\n\n- A take-home assignment that you would be asked to complete in given time. Details about the assignment would be given to applicants before-hand.\n\n- A group discussion to see how you engage with others and gauge how well you can come up with cool ideas.\n\n- An interview for us to know more about you: how you are … Basically we want to understand more about you here.\n\n- An HR interview to know what you’re looking for and what you can offer to IET NITK and Inkheart in general.\n\n\n\n## *Venture*\n\n\n\nVenture SIG is a platform to learn and build up and explore the domains in the field of commerce, economics, management and much more.\n\n\n\nEven though being the latest member of the IET NITK family, we have planned upon our upcoming project ideas. Some of them are Stock Trading Bot, Blockchain based peer to peer mobile payment platform, Merger and Acquisition case study, Mock Start-up case study and much more.\n\n\n\nOne of the trademark events that we conducted was TRADEVERSE. Tradeverse provided a platform to gain first hand experience on the Stock market as well as training. The KEP we provided gave everyone a strong basis about the same and the next two days of virtual trading provided everyone the best place to learn and acquire new skills as well as interact with many people during these hard times. And, the whole event had an added bonus of cash prizes for its winners. We have also started a mini video series where we provide information as well as the basis of different fields related to business, management and economics. Our first short clip on Entrepreneurship provided solid understanding about the same.\n\n\n\nWe conduct interesting and exciting events not only for everyone but specifically for members as well. The IPL auction event conducted for club members proved to be successful as well as engaging. Different team involved in a fun and intense auction was just the perfect thing we needed to cool out our mind but also gave us insight into various aspects of auctioning as well.\n\n\n\n## Recruitment Process\n\n\n\nThe first step, as always, is to fill the main IET NITK recruitment form from here. With that done, following is the process:\n\n- A Technical + Aptitude test to evaluate your knowledge.\n\n- A Technical interview for us to know more about you: how you approach problems in the fields of our interest and what are your views to some of the current problems faced in finance/economics.\n\n- An HR interview to know what you’re looking for and what you can offer to IET NITK and Venture in general.\n\n\n\n## *Tips for Recruitment Season*\n\n\n\n![ietnitk_intro](https://user-images.githubusercontent.com/85332648/229377512-23bfdcd5-cd38-4b87-802c-8fe7fa949c1e.jpg)\n\n\n\n*That's how a recruitment interview would've been if college wasn't virtual ... This is from one of the rooms in Main Building.*\n\n\n\nWe have some tips for you on how to handle the season:\n\n- Most importantly, keep calm throughout.\n\n- Keep an open mind during the interviews: speak what you’re thinking.\n\n- Be honest with your expectations: both what you can deliver as well as what the club can give you.\n\n- Ask questions: the test would prove your technical capabilities, but club interviews are mostly about how\n\n\n\n##### *WRITTEN BY VISHWA MOHAN TIWARI AND LAKSH SADHWANI - OCTOBER 7TH, 2022*"
      }
    ],
    "events": [
      {
        "id": "-NS2ftV2eDkoOrNUgMu1",
        "title": "CREATE THE FUTURE - YPCSA CONNECT",
        "date": "NOVEMBER 2ND, 2022",
        "slug": "create-future",
        "markdown": "# CREATE THE FUTURE - YPCSA CONNECT\n\n\n\n##### **NOVEMBER 2ND, 2022**\n\n\n\n## Hola Amigos!\n\n\n\nIET NITK in collaboration with IET BLN and IET YPCSA presents **CREATE THE FUTURE - YPCSA CONNECT**\n\n\n\nHave an idea? Learn how to make it purposeful, profitable and patentable by this workshop from **Lokesh Venkatswamy**, CEO and Managing Director of **Innomantra Consulting and Private Ltd.**\n\n\n\nWhat are you waiting for? Develop your mind as the future ELON MUSK and register here : [https://bit.ly/3WhVLkP](https://bit.ly/3WhVLkP)\n\n\n\nParticipate in the competition post the session to bag **Prizes worth Rs.5K**\n\n\n\nSee you all with your great ideas!\n\n\n\n**Date : November 4, 5:30 PM**\n\n\n\n**Venue : Main Seminar Hall**\n\n\n\n![create-future](https://user-images.githubusercontent.com/85332648/229377753-ef38081e-818f-4378-9b40-2fa722855915.jpg)"
      },
      {
        "id": "-NS2g69vul57JHVD5W7q",
        "title": "Lego Gambit",
        "date": "AUGUST 19TH, 2022",
        "slug": "lego-gambit",
        "markdown": "# Lego Gambit\n\n\n\n##### **AUGUST 19TH, 2022**\n\n\n\nStressed about the upcoming endsem examinations? Looking for a stress-busting and an entertaining event? Here we are!!\n\n\n\nIET NITK presents the first offline event of the year Lego Gambit.Lego Gambit, an amusing event with a bunch of thrilling rounds which you get to experience on participating in the event Grab your seat for the most fun-filled event that magnifies your mind relaxation\n\n\n\n# **Registration deadline: 19th August, 2022, 11:59PM**\n\n# **Event date🗓️: 21st August, 2022**\n\n\n\n# AIM \n\nTo provide infotainment in a competitive setting through a trivia gameshow\n\n\n\n# Rules for the Gameshow\n\n- Each team consists of 2 members.\n\n- All teams are put up in a knockout tournament bracket.\n\n- Losing once will result in immediate termination\n\n- 32 teams will be participating in the 1st round, 16 in the next and so on…\n\n- 2 teams will face-off each other in a 20 minute round of 20-25 questions.\n\n- Answering a question correctly will award points\n\n- Each team has 5 hearts. Smashing a heart requires 10 points.\n\n- There is a provision to revive & restore one heart. Restoring a heart requires 15 points.\n\n- There are 2 lifelines in the first round. No lifelines for the rest of the rounds\n\n\n\n> LIFELINES : Call a friend, which requires 3 points & Google 15s search, which requires 7 points.\n\n\n\n# Winning Criteria\n\n\n\n> The first 3 rounds require the teams to try and smash the hearts of opposing teams and eliminate them.The maximum time limit for a round is 20 minutes. In case of tie in the number of hearts at the end of round, a tie breaker question will be asked. As stated above, all games are knockouts and losing even once will result in disqualification from further participation.\n\n\n\n# [REGISTER](https://tripetto.app/run/C7NE4FSLTW)"
      },
      {
        "id": "-NS2gFdiKgmBWAkjHRzf",
        "title": "INNERVE 2022 is here!",
        "date": "FEBRUARY 16TH, 2022",
        "slug": "innerve-22",
        "markdown": "# INNERVE 2022 is here!\n\n\n\n##### **FEBRUARY 16TH, 2022**\n\n\n\nAs said by Matt Mullenweg, Social Media Entrepreneur that **\"Technology is best when it brings people together\"**. This is what we intend to do today. IET presents INNERVE which brings us all together for 4 amazing days where people from various domains gather around to discuss and make ideas happen. Explore and try to find your passion and learn all about business and technology.\n\n\n\nThere will be Knowledge Exchange Programs and fun competitions to test your skills. We have tried to inculcate ideas from various domains so you will definitely find something of your liking ;)\n\n\n\n# **Cipher**\n\nThe first event is by **CIPHER** where you can learn all about cryptography and steganography. So get ready to wrack your brain for the puzzles. As we know it's not all about ideas **but it's about making ideas happen so we present you with this exciting competition** _ **\"TURING IT\"** _. Inspired by the very famous cryptanalyst ALAN TURING get ready to find your inner turing.\n\n\n\n## Introduction to Cryptography and Steganography\n\n\n\nAn Introductory KEP covering basic concepts of Cryptography and Steganography by Ramprasad Attada Link: [https://youtu.be/-071dpDyzhk](https://youtu.be/-071dpDyzhk)\n\n\n\n# TURING IT\n\n\n\nA contest where participants find and decrypt hidden messages to score points. Questions asked here will be related to stuff taught in KEP.\n\n\n\n(Open to just 1st and 2nd years)\n\n\n\nDATE: **19 FEB**\n\n\n\nTIME:\n\n\n\n- KEP - **Intro to Cryptography and Steganography - 12PM**\n\n- CONTEST - **3PM**\n\n\n\n# Rovisp\n\n\n\nThe second event we present to you is an amazing **ARDUINO WORKSHOP** by **ROVISP**. Arduino refers to an open-source electronics platform or board and the software used to program it. Arduino is designed to make electronics more accessible to artists, designers, hobbyists and anyone interested in creating interactive objects or environments. So get started with the clink clank of the circuits and introducing electronics to a whole other era because creating and building is what we do.\n\n\n\nDATE: **20 FEB**\n\n\n\nTIME: **Arduino workshop **- 1 PM Link: [https://meet.google.com/ubm-seek-yrg](https://meet.google.com/ubm-seek-yrg)\n\n\n\nSPEAKER: **Nithin L N**\n\n\n\n# Torsion:\n\n\n\nTechnology is an art which converts imagination into reality. We as engineers are very important to society. So our duty is to keep brainstorming and reinventing our ideas. So to convert this into reality we present you these knowledge exchange programs which will take you to the world of this conversion. The basics are the foundation of anything so brush up your basics and kick start this journey with **TORSION**.\n\n\n\n## KEP -1 Concepts of FEA and CFD\n\n\n\nDATE: **21 FEB**\n\n\n\nTIME: **4PM**\n\n\n\nSPEAKERS - **Harikrishnan S and S Sriram** Link: [https://www.youtube.com/watch?v=q06IklIBgTM](https://www.youtube.com/watch?v=q06IklIBgTM)\n\n\n\n## KEP-2- MatCoach: Your Foundation to MatLab\n\n\n\nTIME: **6PM** SPEAKERS - **Naveen and Abin Sibichan** Link: [https://www.youtube.com/watch?v=cOrgZ58bYpo](https://www.youtube.com/watch?v=cOrgZ58bYpo)\n\n\n\n# Venture\n\n\n\nThe last event is for all the business minds out there. Do not worry we got you too! **VENTURE** presents you to a KEP on **ART OF NEGOTIATION** which is very crucial in the business world. So showcase your inner negotiations and charm your way out of this amazing contest where you will apply it like in real life with a twist. You will be in charge of real life football clubs. It all depends on how you communicate. What are you waiting for? Go get 'em!\n\n\n\n**SOCCERSCAPE** - A contest where teams will be in charge of real life football clubs. They will be responsible for buying and selling players with a budget given. The team with the best team at the end of the event will be declared the winner. The focus of the event is to analyze the negotiating skills of the members as they must be in communication with other teams to move players around.\n\n\n\nDATE: **22 FEB**\n\n\n\nTIME: **KEP - Intro to Negotiation - 12PM** Link: [https://youtu.be/aoxFSi97iHs](https://youtu.be/aoxFSi97iHs) **EVENT - Soccerscape - 2PM**\n\n\n\nExcited? So are we!!\n\n\n\nTo register for any of the above events, please fill out the below form: **Register now**: [https://forms.gle/5UgeMeNzbMnrkCvC70](https://forms.gle/5UgeMeNzbMnrkCvC7)"
      }
    ],
    "projects": [
      {
        "id": "-NS2fA85sXrWWx6j9kR3",
        "title": "Equation Solver",
        "built_by": "Rachana P J, Dolly Gupta, M B Sai Aditya and Lalit Nagar",
        "github_link": "https://github.com/IET-NITK/HandwrittenEquationSolver",
        "description": "Train a deep learning model to recognise handwritten equations from images and then give the result after solving the equations.",
        "slug": "equationsolver",
        "markdown": "# Built by\n\n- **Rachana P J**\n\n- **Dolly Gupta**\n\n- **M B Sai Aditya**\n\n- **Lalit Nagar**\n\n\n\n# Handwritten Equation Solver\n\n\n\n\n\n## AIM of the Project\n\nAs the name of the project suggests, we intend to make such a system(Web Interface) in which user will just upload his/her handwritten equation(s) and in return would get the solution to that.\n\n> Note: The project is restricted only for Polynomials & Linear Equations(1 & 2 Variable)\n\n\n\n## Implementation\n\n- For detecting handwritten equation, we need to detect number,mathematical symbols,variables etc. So firstly, we trained a CNN(Convolutional Nueral Network) Model over a specified dataset.\n\n- Now once the CNN Model was tested enough for detecting handwritten contents, we further proceed to apply some Algebra to solve these detected Equations/Polynomials.\n\n- Then, we created a Frontend where user can upload & crop the images of the handwritten equation and can feed it further to the Backend Servers.\n\n- The user uploaded images are way to diffrent from the images that CNN demands,Hence we applied Image processing(OpenCV) on the user uploaded image to convert it into a desired image.\n\n\n\n## Frameworks & Modules Used\n\n- **Tensorflow** & **Keras** (for Training & Testing CNN Model)\n\n- **Flask** Web Framework (for Backend)\n\n- **HTML**,**CSS**,**JS**,**Bootstrap**(for Frontend)\n\n- **OpenCV** Library of Python (for Image Processing)\n\n- **sympy** module(Handles all equation Solving)\n\n\n\n## Working of the Project\n\n> Note: For the project 'a','b' are variables & 'x' is the multiplication sign.Also '=0' is already understood by the model so user need not write it. So if the Equation is 15a=45, then user need to write 15a-45 and then upload it on the website.\n\n- The user uploads an image to the website as shown below:-\n\n![eq](https://user-images.githubusercontent.com/85332648/161968276-040dad35-b81d-4a47-b595-f428496ff800.jpeg)\n\n- Then the image is processed and converted to desired image that model wants as shown below.\n\n![image](https://user-images.githubusercontent.com/85332648/161968517-78d5adaf-96bc-472b-a5c2-7dbab94c7bdf.png)\n\n- Model then detect that an equation with **variable 'a'** has been uploaded & generates the following output.\n\n![image](https://user-images.githubusercontent.com/85332648/161969317-027e503f-a9a7-45b4-b077-d06458b8e9b0.png)\n\n- Similarly for **Linear Equation in two variable** user need to upload two Images as shown below:-\n\n![eq1](https://user-images.githubusercontent.com/85332648/161969873-2dd69652-67b2-4930-9de3-c97184875e3c.jpeg)\n\n![eq2](https://user-images.githubusercontent.com/85332648/161969912-505cc709-95ba-492b-bfd7-dcce54944027.jpeg)\n\n- Again Model coverts both images as desired images & Solves it!!\n\n![image](https://user-images.githubusercontent.com/85332648/161970223-07b7aaa5-ef10-49d9-b28e-d6ff49df8766.png)\n\n![image](https://user-images.githubusercontent.com/85332648/161970272-64c63894-d011-4e15-9264-5f33c4609531.png)\n\n- **Model produces Following output:-**\n\n\n\n![image](https://user-images.githubusercontent.com/85332648/161970375-8d5d9888-e699-4a15-819d-52a759ddd2cc.png)\n\n\n\n## Why CNN?\n\n- In traditional Neural Networks, one need to specify the important features to be considered while **CNN** automatically detects the important features without any **Human Supervision.**\n\n- Our project involved **high level pixel processing** and CNN's are considered to be the best for that as it can learn the key features for any class itself.\n\n- **CNN's** even have better accuracy than any other **Machine Learning Model** when it comes to **\"Detection\"**.Hence CNN was the best thing to be used for this project.\n\n\n\n## Challenges We ran into\n\n- When we trained the CNN Model for **\"=\"** , **\"(\"** & **\")\"** signs, its accuracy reduced significantly which is absurd.\n\n- Introducing variable **\"x\"** was challenging as **\"x\"** also represents multiplication sign. So we introduced **\"a\"** & **\"b\"** as variables.\n\n- User is constrained to write the equation in a paper with white unruled background. Ruled background confuses the CNN Model & it produces unusual results.\n\n\n\n## Steps to Test Backend\n\n- Download the **.ipynb** file from the github & upload it in **Google Colab**.\n\n- Also Do upload the **model** folder in the colab environment.\n\n- Now you may upload your own custom equations in the Colab environment & all other steps are mentioned in the .ipynb file itself.\n\n> Do Ensure that you crop the equation to the maximum extent.\n\n> Do this!!!👇👇👇\n\n\n\n![2](https://user-images.githubusercontent.com/85332648/161974694-5f5fb2a0-1244-47f1-b9c5-3164d41d216c.jpeg)\n\n> Not this!!!👇👇👇\n\n\n\n![eq7](https://user-images.githubusercontent.com/85332648/161974775-dd58c278-7488-45ca-b272-f08e15a5ce46.jpeg)\n\n\n\n\n\n"
      },
      {
        "id": "-NS2fP2JXgPgbtaellxp",
        "title": "YouTube Transcript Summarizer",
        "built_by": "Suyash Satish Chintawar, Feyaz Baker, Venkat Rohit Merugu, Naveen Kumar, Gaurav Kumar and Sahana",
        "github_link": "https://github.com/IET-NITK/YT-Transcript-Summarizer",
        "description": " ",
        "slug": "youtubetranscriptsummarizer",
        "markdown": "# Built by\n\n- **Suyash Satish Chintawar**\n\n- **Feyaz Baker**\n\n- **Venkat Rohit Merugu**\n\n- **Naveen Kumar**\n\n- **Gaurav Kumar**\n\n- **Sahana**\n\n\n\n# YouTube Transcript Summarizer\n\n\n\n\n\n## Introduction\n\nThroughout the day, an enormous number of video recordings are generated and shared on the Internet. It has become quite difficult to devote time to watching such videos, which may last longer than expected, and our efforts may be in vain if we are unable to extract useful information from them.\n\n\n\nSummarizing transcripts of such videos allows us to rapidly look for relevant patterns in the video and saves us time and effort from having to go through the entire content. This project will allow us to gain hands-on experience with cutting-edge NLP techniques for abstractive text summarization.\n\n\n\n## Dependencies and Requirements\n\n- `flask==2.0.2`\n\n- `torch==1.10.2`\n\n- `urllib3==1.26.8`\n\n- `transformers==4.16.2`\n\n- `huggingface-hub==0.4.0`\n\n- `youtube-transcript-api==0.4.3`\n\n- `bert-extractive-summarizer==0.10.1`\n\n\n\n## Running the website\n\n1. Clone repository\n\n\n\n`git clone https://github.com/IET-NITK/IETC-YT-Transcript-Summarizer`\n\n\n\n2. Install requirements\n\n\n\n`pip install -r requirements.txt`\n\n\n\n3. Run website\n\n\n\n`python3 app.py`\n\n\n\n## Methodology\n\nThree major steps are involved:\n\n\n\n- Fetching Subtitles : ‘youtube_transcript_api’ has been used to extract summary for a youtube video by passing the video ID as the input to the api.\n\n- Summarizing transcripts : BERT extractive summarisation has been used to summarize the obtained video transcript.\n\n- Display summary on website : The summary is then displayed on the website hosted on flask server.\n\n\n\n## Challenges\n\n- Finding good abstractive text summarization techniques.\n\n- Time required in summarization.\n\n\n\n\n\n\n\n\n\n"
      },
      {
        "id": "-NS2fcQENosIpmChYIGN",
        "title": "Audio To Sign Language Translator",
        "built_by": "Jagan Babu Korra, Vaishnavi Prakash Kalgutkar, K Sriram, Kowshic V and Ansh Bindlish",
        "github_link": "https://github.com/IET-NITK/A2SL-Translator",
        "description": "We build an ML based tool that converts audio to sign language. Conversion of audio to ISL helps the common folks to interact with people with such disabilities without the language barrier, enriching both of their lives.",
        "slug": "audiotosignlanguagetranslator",
        "markdown": "# Built by\n\n- **Jagan Babu Korra**\n\n- **Vaishnavi Prakash Kalgutkar**\n\n- **K Sriram**\n\n- **Kowshic V**\n\n- **Ansh Bindlish**\n\n\n\n\n\n# Audio to Sign Language Translator\n\n\n\n\n\nSign languages are visual languages that use hand, facial and body movements as a means of communication. There are over 135 different sign languages all around the world including American Sign Language (ASL), Indian Sign Language (ISL) and British Sign Language (BSL). Sign languages are an extremely important communication tool for many deaf and hard-of-hearing people. Sign languages are the native languages of the Deaf community and provide full access to communication. Although sign languages are used primarily by people who are deaf, they are also used by others, such as people who can hear but can’t speak. Conversion of audio to ISL helps the common folks to interact with people with such disabilities without the language barrier, enriching both of their lives.\n\n\n\n## Methodology\n\n- Audio input on the platform using Python Speech Recognition module.\n\n- Conversion of audio to text using Google Speech API.\n\n- Dependency parser for analysing grammatical structure of the sentence and establishing relationship between words.\n\n- ISL Generator: ISL of input sentence using ISL grammar rules.\n\n- Generation of Sign language with concatenating videos\n\n\n\n## Libraries used\n\n- streamlit\n\n- speech_recognition\n\n- cv2\n\n- numpy\n\n- moviepy\n\n- nltk\n\n\n\n## Timeline\n\n\n\n| **STEP** | **TIME NEEDED** |\n\n| --- | ----------- |\n\n| Learning process | 35 days |\n\n| Working on theory to design | 15 days |\n\n| Designing the model/Coding | 25 days |\n\n| Working on changes and simulations\t | 10 days |\n\n| Analysis | 2 days |\n\n\n\n## Challenges\n\n- Compiling a quality repository of words and alphabets for output video.\n\n- Time required in processing video.\n\n\n\n\n\n"
      }
    ]
  }
  